app/controllers/images_controller.rb

  def content
    result=ImageContent.image(@image).smallest(params[:width],params[:height]).first
---
SELECT  "images".* FROM "images" WHERE "images"."id" = $1 LIMIT 1  [["id", 32]]

  def create
    authorize Image
    @image = Image.new(image_params)
    @image.creator_id=current_user.id

    User.transaction do
      if @image.save

        if params[:user_id]
          user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."uid" = $1 LIMIT 1  [["uid", "test1@test.com"]]